pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>MONDTCTL7</name>
                    <description>desc MONDTCTL7</description>
                    <addressOffset>0x228</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>BLKSIZE</name>
                            <description>desc BLKSIZE</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONRPT7</name>
                    <description>desc MONRPT7</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FF03FF</resetMask>
                    <fields>
                        <field>
                            <name>SRPT</name>
                            <description>desc SRPT</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DRPT</name>
                            <description>desc DRPT</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONSNSEQCTL7</name>
                    <description>desc MONSNSEQCTL7</description>
                    <addressOffset>0x230</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFFSET</name>
                            <description>desc SOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SNSCNT</name>
                            <description>desc SNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONDNSEQCTL7</name>
                    <description>desc MONDNSEQCTL7</description>
                    <addressOffset>0x234</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DOFFSET</name>
                            <description>desc DOFFSET</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DNSCNT</name>
                            <description>desc DNSCNT</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="DMA1">
            <name>DMA2</name>
            <description>desc DMA</description>
            <baseAddress>0x40053400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x238</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>DMC</name>
            <description>desc DMC</description>
            <baseAddress>0x88000400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x304</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>STSR</name>
                    <description>desc STSR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x700</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>STATUS</name>
                            <description>desc STATUS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MEMW</name>
                            <description>desc MEMW</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STCR</name>
                    <description>desc STCR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>STCTL</name>
                            <description>desc STCTL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDR</name>
                    <description>desc CMDR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3FFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDADD</name>
                            <description>desc CMDADD</description>
                            <msb>13</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDBA</name>
                            <description>desc CMDBA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMD</name>
                            <description>desc CMD</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDCHIP</name>
                            <description>desc CMDCHIP</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPCR</name>
                    <description>desc CPCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x20040</resetValue>
                    <resetMask>0x307FFF7</resetMask>
                    <fields>
                        <field>
                            <name>COLBS</name>
                            <description>desc COLBS</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ROWBS</name>
                            <description>desc ROWBS</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APBS</name>
                            <description>desc APBS</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKEDIS</name>
                            <description>desc CKEDIS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKSTOP</name>
                            <description>desc CKSTOP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKEDISPRD</name>
                            <description>desc CKEDISPRD</description>
                            <msb>15</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BURST</name>
                            <description>desc BURST</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACTCP</name>
                            <description>desc ACTCP</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFTR</name>
                    <description>desc RFTR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA60</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <fields>
                        <field>
                            <name>REFPRD</name>
                            <description>desc REFPRD</description>
                            <msb>14</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_CASL</name>
                    <description>desc TMCR_T_CASL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_CASL</name>
                            <description>desc T_CASL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_DQSS</name>
                    <description>desc TMCR_T_DQSS</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>T_DQSS</name>
                            <description>desc T_DQSS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_MRD</name>
                    <description>desc TMCR_T_MRD</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>T_MRD</name>
                            <description>desc T_MRD</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_RAS</name>
                    <description>desc TMCR_T_RAS</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>T_RAS</name>
                            <description>desc T_RAS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_RC</name>
                    <description>desc TMCR_T_RC</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xB</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_RCD</name>
                    <description>desc TMCR_T_RCD</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x35</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>T_RCD_B</name>
                            <description>desc T_RCD_B</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>T_RCD_P</name>
                            <description>desc T_RCD_P</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_RFC</name>
                    <description>desc TMCR_T_RFC</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1012</resetValue>
                    <resetMask>0x1F1F</resetMask>
                    <fields>
                        <field>
                            <name>T_RFC_B</name>
                            <description>desc T_RFC_B</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>T_RFC_P</name>
                            <description>desc T_RFC_P</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_RP</name>
                    <description>desc TMCR_T_RP</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x35</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>T_RP_B</name>
                            <description>desc T_RP_B</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>T_RP_P</name>
                            <description>desc T_RP_P</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_RRD</name>
                    <description>desc TMCR_T_RRD</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>T_RRD</name>
                            <description>desc T_RRD</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_WR</name>
                    <description>desc TMCR_T_WR</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_WR</name>
                            <description>desc T_WR</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_WTR</name>
                    <description>desc TMCR_T_WTR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>T_WTR</name>
                            <description>desc T_WTR</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_XP</name>
                    <description>desc TMCR_T_XP</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>T_XP</name>
                            <description>desc T_XP</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR_T_XSR</name>
                    <description>desc TMCR_T_XSR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>T_XSR</name>
                            <description>desc T_XSR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
