pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>F0NWPRT1</name>
                    <description>desc F0NWPRT1</description>
                    <addressOffset>0x194</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F0NWPRT32</name>
                            <description>desc F0NWPRT32</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT33</name>
                            <description>desc F0NWPRT33</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT34</name>
                            <description>desc F0NWPRT34</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT35</name>
                            <description>desc F0NWPRT35</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT36</name>
                            <description>desc F0NWPRT36</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT37</name>
                            <description>desc F0NWPRT37</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT38</name>
                            <description>desc F0NWPRT38</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT39</name>
                            <description>desc F0NWPRT39</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT40</name>
                            <description>desc F0NWPRT40</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT41</name>
                            <description>desc F0NWPRT41</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT42</name>
                            <description>desc F0NWPRT42</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT43</name>
                            <description>desc F0NWPRT43</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT44</name>
                            <description>desc F0NWPRT44</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT45</name>
                            <description>desc F0NWPRT45</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT46</name>
                            <description>desc F0NWPRT46</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT47</name>
                            <description>desc F0NWPRT47</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT48</name>
                            <description>desc F0NWPRT48</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT49</name>
                            <description>desc F0NWPRT49</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT50</name>
                            <description>desc F0NWPRT50</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT51</name>
                            <description>desc F0NWPRT51</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT52</name>
                            <description>desc F0NWPRT52</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT53</name>
                            <description>desc F0NWPRT53</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT54</name>
                            <description>desc F0NWPRT54</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT55</name>
                            <description>desc F0NWPRT55</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT56</name>
                            <description>desc F0NWPRT56</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT57</name>
                            <description>desc F0NWPRT57</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT58</name>
                            <description>desc F0NWPRT58</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT59</name>
                            <description>desc F0NWPRT59</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT60</name>
                            <description>desc F0NWPRT60</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT61</name>
                            <description>desc F0NWPRT61</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT62</name>
                            <description>desc F0NWPRT62</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT63</name>
                            <description>desc F0NWPRT63</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0NWPRT2</name>
                    <description>desc F0NWPRT2</description>
                    <addressOffset>0x198</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F0NWPRT64</name>
                            <description>desc F0NWPRT64</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT65</name>
                            <description>desc F0NWPRT65</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT66</name>
                            <description>desc F0NWPRT66</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT67</name>
                            <description>desc F0NWPRT67</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT68</name>
                            <description>desc F0NWPRT68</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT69</name>
                            <description>desc F0NWPRT69</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT70</name>
                            <description>desc F0NWPRT70</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT71</name>
                            <description>desc F0NWPRT71</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT72</name>
                            <description>desc F0NWPRT72</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT73</name>
                            <description>desc F0NWPRT73</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT74</name>
                            <description>desc F0NWPRT74</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT75</name>
                            <description>desc F0NWPRT75</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT76</name>
                            <description>desc F0NWPRT76</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT77</name>
                            <description>desc F0NWPRT77</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT78</name>
                            <description>desc F0NWPRT78</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT79</name>
                            <description>desc F0NWPRT79</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT80</name>
                            <description>desc F0NWPRT80</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT81</name>
                            <description>desc F0NWPRT81</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT82</name>
                            <description>desc F0NWPRT82</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT83</name>
                            <description>desc F0NWPRT83</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT84</name>
                            <description>desc F0NWPRT84</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT85</name>
                            <description>desc F0NWPRT85</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT86</name>
                            <description>desc F0NWPRT86</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT87</name>
                            <description>desc F0NWPRT87</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT88</name>
                            <description>desc F0NWPRT88</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT89</name>
                            <description>desc F0NWPRT89</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT90</name>
                            <description>desc F0NWPRT90</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT91</name>
                            <description>desc F0NWPRT91</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT92</name>
                            <description>desc F0NWPRT92</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT93</name>
                            <description>desc F0NWPRT93</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT94</name>
                            <description>desc F0NWPRT94</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F0NWPRT95</name>
                            <description>desc F0NWPRT95</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
