pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>F1NWPRT1</name>
                    <description>desc F1NWPRT1</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F1NWPRT32</name>
                            <description>desc F1NWPRT32</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT33</name>
                            <description>desc F1NWPRT33</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT34</name>
                            <description>desc F1NWPRT34</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT35</name>
                            <description>desc F1NWPRT35</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT36</name>
                            <description>desc F1NWPRT36</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT37</name>
                            <description>desc F1NWPRT37</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT38</name>
                            <description>desc F1NWPRT38</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT39</name>
                            <description>desc F1NWPRT39</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT40</name>
                            <description>desc F1NWPRT40</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT41</name>
                            <description>desc F1NWPRT41</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT42</name>
                            <description>desc F1NWPRT42</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT43</name>
                            <description>desc F1NWPRT43</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT44</name>
                            <description>desc F1NWPRT44</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT45</name>
                            <description>desc F1NWPRT45</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT46</name>
                            <description>desc F1NWPRT46</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT47</name>
                            <description>desc F1NWPRT47</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT48</name>
                            <description>desc F1NWPRT48</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT49</name>
                            <description>desc F1NWPRT49</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT50</name>
                            <description>desc F1NWPRT50</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT51</name>
                            <description>desc F1NWPRT51</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT52</name>
                            <description>desc F1NWPRT52</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT53</name>
                            <description>desc F1NWPRT53</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT54</name>
                            <description>desc F1NWPRT54</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT55</name>
                            <description>desc F1NWPRT55</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT56</name>
                            <description>desc F1NWPRT56</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT57</name>
                            <description>desc F1NWPRT57</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT58</name>
                            <description>desc F1NWPRT58</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT59</name>
                            <description>desc F1NWPRT59</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT60</name>
                            <description>desc F1NWPRT60</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT61</name>
                            <description>desc F1NWPRT61</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT62</name>
                            <description>desc F1NWPRT62</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT63</name>
                            <description>desc F1NWPRT63</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1NWPRT2</name>
                    <description>desc F1NWPRT2</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>F1NWPRT64</name>
                            <description>desc F1NWPRT64</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT65</name>
                            <description>desc F1NWPRT65</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT66</name>
                            <description>desc F1NWPRT66</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT67</name>
                            <description>desc F1NWPRT67</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT68</name>
                            <description>desc F1NWPRT68</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT69</name>
                            <description>desc F1NWPRT69</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT70</name>
                            <description>desc F1NWPRT70</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT71</name>
                            <description>desc F1NWPRT71</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT72</name>
                            <description>desc F1NWPRT72</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT73</name>
                            <description>desc F1NWPRT73</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT74</name>
                            <description>desc F1NWPRT74</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT75</name>
                            <description>desc F1NWPRT75</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT76</name>
                            <description>desc F1NWPRT76</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT77</name>
                            <description>desc F1NWPRT77</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT78</name>
                            <description>desc F1NWPRT78</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT79</name>
                            <description>desc F1NWPRT79</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT80</name>
                            <description>desc F1NWPRT80</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT81</name>
                            <description>desc F1NWPRT81</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT82</name>
                            <description>desc F1NWPRT82</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT83</name>
                            <description>desc F1NWPRT83</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT84</name>
                            <description>desc F1NWPRT84</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT85</name>
                            <description>desc F1NWPRT85</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT86</name>
                            <description>desc F1NWPRT86</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT87</name>
                            <description>desc F1NWPRT87</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT88</name>
                            <description>desc F1NWPRT88</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT89</name>
                            <description>desc F1NWPRT89</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT90</name>
                            <description>desc F1NWPRT90</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT91</name>
                            <description>desc F1NWPRT91</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT92</name>
                            <description>desc F1NWPRT92</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT93</name>
                            <description>desc F1NWPRT93</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT94</name>
                            <description>desc F1NWPRT94</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>F1NWPRT95</name>
                            <description>desc F1NWPRT95</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
