pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="FCM1">
            <name>FCM2</name>
            <description>desc FCM</description>
            <baseAddress>0x40048440</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="FCM1">
            <name>FCM3</name>
            <description>desc FCM</description>
            <baseAddress>0x40048480</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="FCM1">
            <name>FCM4</name>
            <description>desc FCM</description>
            <baseAddress>0x400484C0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>FCM_COM</name>
            <description>desc FCM_COM</description>
            <baseAddress>0x40048400</baseAddress>
            <alternatePeripheral>FCM1</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>START1</name>
                            <description>desc START1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START2</name>
                            <description>desc START2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START3</name>
                            <description>desc START3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START4</name>
                            <description>desc START4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRF1</name>
                            <description>desc ERRF1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MENDF1</name>
                            <description>desc MENDF1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVF1</name>
                            <description>desc OVF1</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRF2</name>
                            <description>desc ERRF2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MENDF2</name>
                            <description>desc MENDF2</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVF2</name>
                            <description>desc OVF2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRF3</name>
                            <description>desc ERRF3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MENDF3</name>
                            <description>desc MENDF3</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVF3</name>
                            <description>desc OVF3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRF4</name>
                            <description>desc ERRF4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MENDF4</name>
                            <description>desc MENDF4</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVF4</name>
                            <description>desc OVF4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
