pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MCAN1</name>
            <description>desc MCAN</description>
            <baseAddress>0x4002B000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFC</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ENDN</name>
                    <description>desc ENDN</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x87654321</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DBTP</name>
                    <description>desc DBTP</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xA33</resetValue>
                    <resetMask>0x9F1FFF</resetMask>
                    <fields>
                        <field>
                            <name>DSJW</name>
                            <description>desc DSJW</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTSEG2</name>
                            <description>desc DTSEG2</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTSEG1</name>
                            <description>desc DTSEG1</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBRP</name>
                            <description>desc DBRP</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDC</name>
                            <description>desc TDC</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEST</name>
                    <description>desc TEST</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3FF0</resetMask>
                    <fields>
                        <field>
                            <name>LBCK</name>
                            <description>desc LBCK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TX</name>
                            <description>desc TX</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RX</name>
                            <description>desc RX</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXBNP</name>
                            <description>desc TXBNP</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PVAL</name>
                            <description>desc PVAL</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXBNS</name>
                            <description>desc TXBNS</description>
                            <msb>20</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SVAL</name>
                            <description>desc SVAL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RWD</name>
                    <description>desc RWD</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WDC</name>
                            <description>desc WDC</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDV</name>
                            <description>desc WDV</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCCR</name>
                    <description>desc CCCR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INIT</name>
                            <description>desc INIT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CCE</name>
                            <description>desc CCE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ASM</name>
                            <description>desc ASM</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSA</name>
                            <description>desc CSA</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CSR</name>
                            <description>desc CSR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MON</name>
                            <description>desc MON</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>desc DAR</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEST</name>
                            <description>desc TEST</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FDOE</name>
                            <description>desc FDOE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRSE</name>
                            <description>desc BRSE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UTSU</name>
                            <description>desc UTSU</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WMM</name>
                            <description>desc WMM</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PXHD</name>
                            <description>desc PXHD</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFBI</name>
                            <description>desc EFBI</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXP</name>
                            <description>desc TXP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NISO</name>
                            <description>desc NISO</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NBTP</name>
                    <description>desc NBTP</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x6000A33</resetValue>
                    <resetMask>0xFFFFFF7F</resetMask>
                    <fields>
                        <field>
                            <name>NTSEG2</name>
                            <description>desc NTSEG2</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NTSEG1</name>
                            <description>desc NTSEG1</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBRP</name>
                            <description>desc NBRP</description>
                            <msb>24</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NSJW</name>
                            <description>desc NSJW</description>
                            <msb>31</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSCC</name>
                    <description>desc TSCC</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0003</resetMask>
                    <fields>
                        <field>
                            <name>TSS</name>
                            <description>desc TSS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCP</name>
                            <description>desc TCP</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSCV</name>
                    <description>desc TSCV</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSC</name>
                            <description>desc TSC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TOCC</name>
                    <description>desc TOCC</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF0000</resetValue>
                    <resetMask>0xFFFF0007</resetMask>
                    <fields>
                        <field>
                            <name>ETOC</name>
                            <description>desc ETOC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOS</name>
                            <description>desc TOS</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOP</name>
                            <description>desc TOP</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TOCV</name>
                    <description>desc TOCV</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TOC</name>
                            <description>desc TOC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECR</name>
                    <description>desc ECR</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TEC</name>
                            <description>desc TEC</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REC</name>
                            <description>desc REC</description>
                            <msb>14</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RP</name>
                            <description>desc RP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CEL</name>
                            <description>desc CEL</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSR</name>
                    <description>desc PSR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x707</resetValue>
                    <resetMask>0x7F7FFF</resetMask>
                    <fields>
                        <field>
                            <name>LEC</name>
                            <description>desc LEC</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ACT</name>
                            <description>desc ACT</description>
                            <msb>4</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EP</name>
                            <description>desc EP</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EW</name>
                            <description>desc EW</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BO</name>
                            <description>desc BO</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DLEC</name>
                            <description>desc DLEC</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RESI</name>
                            <description>desc RESI</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RBRS</name>
                            <description>desc RBRS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDF</name>
                            <description>desc RFDF</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PXE</name>
                            <description>desc PXE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TDCV</name>
                            <description>desc TDCV</description>
                            <msb>22</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
