pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PERIC</name>
            <description>desc PERIC</description>
            <baseAddress>0x40055400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x44</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USB_SYCTLREG</name>
                    <description>desc USB_SYCTLREG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7070703</resetMask>
                    <fields>
                        <field>
                            <name>USBFS_DFB</name>
                            <description>desc USBFS_DFB</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_SOFEN</name>
                            <description>desc USBFS_SOFEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_DFB</name>
                            <description>desc USBHS_DFB</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_SOFEN</name>
                            <description>desc USBHS_SOFEN</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_FSPHYE</name>
                            <description>desc USBHS_FSPHYE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFS</name>
                            <description>desc USBFS_NFS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS_NFE</name>
                            <description>desc USBFS_NFE</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_NFS</name>
                            <description>desc USBHS_NFS</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS_NFE</name>
                            <description>desc USBHS_NFE</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIOC_SYCTLREG</name>
                    <description>desc SDIOC_SYCTLREG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xA</resetMask>
                    <fields>
                        <field>
                            <name>SELMMC1</name>
                            <description>desc SELMMC1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SELMMC2</name>
                            <description>desc SELMMC2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_STCR</name>
                    <description>desc NFC_STCR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>OPENP</name>
                            <description>desc OPENP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXMC_ENAR</name>
                    <description>desc EXMC_ENAR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>DMCEN</name>
                            <description>desc DMCEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMCEN</name>
                            <description>desc SMCEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFCEN</name>
                            <description>desc NFCEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR_SYNENR1</name>
                    <description>desc TMR_SYNENR1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0703FF</resetMask>
                    <fields>
                        <field>
                            <name>TMR0_1_A</name>
                            <description>desc TMR0_1_A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_1_B</name>
                            <description>desc TMR0_1_B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_2_A</name>
                            <description>desc TMR0_2_A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_2_B</name>
                            <description>desc TMR0_2_B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_3_A</name>
                            <description>desc TMR0_3_A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_3_B</name>
                            <description>desc TMR0_3_B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_4_A</name>
                            <description>desc TMR0_4_A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_4_B</name>
                            <description>desc TMR0_4_B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_5_A</name>
                            <description>desc TMR0_5_A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_5_B</name>
                            <description>desc TMR0_5_B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_1</name>
                            <description>desc TMR4_1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_2</name>
                            <description>desc TMR4_2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_3</name>
                            <description>desc TMR4_3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_1</name>
                            <description>desc TMR6_1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_2</name>
                            <description>desc TMR6_2</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_3</name>
                            <description>desc TMR6_3</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_4</name>
                            <description>desc TMR6_4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_5</name>
                            <description>desc TMR6_5</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_6</name>
                            <description>desc TMR6_6</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_7</name>
                            <description>desc TMR6_7</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_8</name>
                            <description>desc TMR6_8</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_SYCTLREG</name>
                    <description>desc CAN_SYCTLREG</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CAN1FDE</name>
                            <description>desc CAN1FDE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN2FDE</name>
                            <description>desc CAN2FDE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USART1_NFC</name>
                    <description>desc USART1_NFC</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>USASRT1_NFS</name>
                            <description>desc USASRT1_NFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1_NFE</name>
                            <description>desc USART1_NFE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NFC_STSR</name>
                    <description>desc NFC_STSR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>CHIP_BUSY</name>
                            <description>desc CHIP_BUSY</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PECC</name>
                            <description>desc PECC</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
