pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>MID_MAC3</name>
                    <description>desc MID_MAC3</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MID_MAC4</name>
                    <description>desc MID_MAC4</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TOTAL_AAD1</name>
                    <description>desc TOTAL_AAD1</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TOTAL_AAD2</name>
                    <description>desc TOTAL_AAD2</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TOTAL_CLEN1</name>
                    <description>desc TOTAL_CLEN1</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>TOTAL_CLEN2</name>
                    <description>desc TOTAL_CLEN2</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>SMC</name>
            <description>desc SMC</description>
            <baseAddress>0x88000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x210</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>STSR</name>
                    <description>desc STSR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STATUS</name>
                            <description>desc STATUS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STCR0</name>
                    <description>desc STCR0</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>LPWIR</name>
                            <description>desc LPWIR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STCR1</name>
                    <description>desc STCR1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>LPWOR</name>
                            <description>desc LPWOR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDR</name>
                    <description>desc CMDR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDADD</name>
                            <description>desc CMDADD</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CRES</name>
                            <description>desc CRES</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMD</name>
                            <description>desc CMD</description>
                            <msb>22</msb>
                            <lsb>21</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDCHIP</name>
                            <description>desc CMDCHIP</description>
                            <msb>25</msb>
                            <lsb>23</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR</name>
                    <description>desc TMCR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77077FF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_WC</name>
                            <description>desc T_WC</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_CEOE</name>
                            <description>desc T_CEOE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_WP</name>
                            <description>desc T_WP</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_TR</name>
                            <description>desc T_TR</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>T_ADV</name>
                            <description>desc T_ADV</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPCR</name>
                    <description>desc CPCR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1B11</resetMask>
                    <fields>
                        <field>
                            <name>RSYN</name>
                            <description>desc RSYN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WSYN</name>
                            <description>desc WSYN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MW</name>
                            <description>desc MW</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ADVS</name>
                            <description>desc ADVS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BLSS</name>
                            <description>desc BLSS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMSR0</name>
                    <description>desc TMSR0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1263CC</resetValue>
                    <resetMask>0x77077FF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC</name>
                            <description>desc T_WC</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE</name>
                            <description>desc T_CEOE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP</name>
                            <description>desc T_WP</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR</name>
                            <description>desc T_TR</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_ADV</name>
                            <description>desc T_ADV</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR0</name>
                    <description>desc CPSR0</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFF0A00</resetValue>
                    <resetMask>0xFFFF1B11</resetMask>
                    <fields>
                        <field>
                            <name>RSYN</name>
                            <description>desc RSYN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN</name>
                            <description>desc WSYN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MW</name>
                            <description>desc MW</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS</name>
                            <description>desc ADVS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS</name>
                            <description>desc BLSS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMSR1</name>
                    <description>desc TMSR1</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1263CC</resetValue>
                    <resetMask>0x77077FF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC</name>
                            <description>desc T_WC</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE</name>
                            <description>desc T_CEOE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP</name>
                            <description>desc T_WP</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR</name>
                            <description>desc T_TR</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_ADV</name>
                            <description>desc T_ADV</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR1</name>
                    <description>desc CPSR1</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFF0A00</resetValue>
                    <resetMask>0xFFFF1B11</resetMask>
                    <fields>
                        <field>
                            <name>RSYN</name>
                            <description>desc RSYN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN</name>
                            <description>desc WSYN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MW</name>
                            <description>desc MW</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS</name>
                            <description>desc ADVS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS</name>
                            <description>desc BLSS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMSR2</name>
                    <description>desc TMSR2</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1263CC</resetValue>
                    <resetMask>0x77077FF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC</name>
                            <description>desc T_WC</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE</name>
                            <description>desc T_CEOE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP</name>
                            <description>desc T_WP</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR</name>
                            <description>desc T_TR</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_ADV</name>
                            <description>desc T_ADV</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
