pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>CPSR2</name>
                    <description>desc CPSR2</description>
                    <addressOffset>0x144</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFF0A00</resetValue>
                    <resetMask>0xFFFF1B11</resetMask>
                    <fields>
                        <field>
                            <name>RSYN</name>
                            <description>desc RSYN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN</name>
                            <description>desc WSYN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MW</name>
                            <description>desc MW</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS</name>
                            <description>desc ADVS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS</name>
                            <description>desc BLSS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMSR3</name>
                    <description>desc TMSR3</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1263CC</resetValue>
                    <resetMask>0x77077FF</resetMask>
                    <fields>
                        <field>
                            <name>T_RC</name>
                            <description>desc T_RC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WC</name>
                            <description>desc T_WC</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_CEOE</name>
                            <description>desc T_CEOE</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_WP</name>
                            <description>desc T_WP</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_TR</name>
                            <description>desc T_TR</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T_ADV</name>
                            <description>desc T_ADV</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR3</name>
                    <description>desc CPSR3</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFF0A00</resetValue>
                    <resetMask>0xFFFF1B11</resetMask>
                    <fields>
                        <field>
                            <name>RSYN</name>
                            <description>desc RSYN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WSYN</name>
                            <description>desc WSYN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MW</name>
                            <description>desc MW</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADVS</name>
                            <description>desc ADVS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BLSS</name>
                            <description>desc BLSS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BACR</name>
                    <description>desc BACR</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x300</resetValue>
                    <resetMask>0xC010</resetMask>
                    <fields>
                        <field>
                            <name>MUXMD</name>
                            <description>desc MUXMD</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKSEL</name>
                            <description>desc CKSEL</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCR0</name>
                    <description>desc CSCR0</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK0</name>
                            <description>desc ADDMSK0</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMSK1</name>
                            <description>desc ADDMSK1</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMSK2</name>
                            <description>desc ADDMSK2</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMSK3</name>
                            <description>desc ADDMSK3</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCR1</name>
                    <description>desc CSCR1</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMAT0</name>
                            <description>desc ADDMAT0</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT1</name>
                            <description>desc ADDMAT1</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT2</name>
                            <description>desc ADDMAT2</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT3</name>
                            <description>desc ADDMAT3</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
