pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>HCDOR</name>
                    <description>desc HCDOR</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>HCDO0</name>
                            <description>desc HCDO0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO1</name>
                            <description>desc HCDO1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO2</name>
                            <description>desc HCDO2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO3</name>
                            <description>desc HCDO3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO4</name>
                            <description>desc HCDO4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO5</name>
                            <description>desc HCDO5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO6</name>
                            <description>desc HCDO6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO7</name>
                            <description>desc HCDO7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO8</name>
                            <description>desc HCDO8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO9</name>
                            <description>desc HCDO9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO10</name>
                            <description>desc HCDO10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO11</name>
                            <description>desc HCDO11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO16</name>
                            <description>desc HCDO16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO17</name>
                            <description>desc HCDO17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO18</name>
                            <description>desc HCDO18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO19</name>
                            <description>desc HCDO19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO20</name>
                            <description>desc HCDO20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO21</name>
                            <description>desc HCDO21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO22</name>
                            <description>desc HCDO22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCDO23</name>
                            <description>desc HCDO23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTNUMR</name>
                    <description>desc PTNUMR</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTPERR</name>
                    <description>desc PTPERR</description>
                    <addressOffset>0x204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PTPER</name>
                            <description>desc PTPER</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTRMDR</name>
                    <description>desc PTRMDR</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTCTLR</name>
                    <description>desc PTCTLR</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x10F</resetMask>
                    <fields>
                        <field>
                            <name>PTOENA</name>
                            <description>desc PTOENA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AOUTENA</name>
                            <description>desc AOUTENA</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BOUTENA</name>
                            <description>desc BOUTENA</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZOUTENA</name>
                            <description>desc ZOUTENA</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WORKF</name>
                            <description>desc WORKF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTAOPR</name>
                    <description>desc PTAOPR</description>
                    <addressOffset>0x220</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>PTBOP</name>
                            <description>desc PTBOP</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTBOPR</name>
                    <description>desc PTBOPR</description>
                    <addressOffset>0x228</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>PTBOP</name>
                            <description>desc PTBOP</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTZOSPR</name>
                    <description>desc PTZOSPR</description>
                    <addressOffset>0x240</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTZOEPR</name>
                    <description>desc PTZOEPR</description>
                    <addressOffset>0x248</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTZCMPBR</name>
                    <description>desc PTZCMPBR</description>
                    <addressOffset>0x264</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ZCMPB</name>
                            <description>desc ZCMPB</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZCMPBENA</name>
                            <description>desc ZCMPBENA</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTZPERR</name>
                    <description>desc PTZPERR</description>
                    <addressOffset>0x268</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTPSPR</name>
                    <description>desc PTPSPR</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTPSTR</name>
                    <description>desc PTPSTR</description>
                    <addressOffset>0x284</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F0F</resetMask>
                    <fields>
                        <field>
                            <name>APORTST</name>
                            <description>desc APORTST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BPORTST</name>
                            <description>desc BPORTST</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZPORTST</name>
                            <description>desc ZPORTST</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIRIND</name>
                            <description>desc SDIRIND</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABSTP</name>
                            <description>desc ABSTP</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PTPCPR</name>
                    <description>desc PTPCPR</description>
                    <addressOffset>0x290</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PTPCTR</name>
                    <description>desc PTPCTR</description>
                    <addressOffset>0x294</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F0F</resetMask>
                    <fields>
                        <field>
                            <name>APORTCR</name>
                            <description>desc APORTCR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BPORTCR</name>
                            <description>desc BPORTCR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ZPORTCR</name>
                            <description>desc ZPORTCR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CDIRIND</name>
                            <description>desc CDIRIND</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ABCRP</name>
                            <description>desc ABCRP</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
