pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>PCONR1</name>
                    <description>desc PCONR1</description>
                    <addressOffset>0x140</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13FF</resetMask>
                    <fields>
                        <field>
                            <name>STAC</name>
                            <description>desc STAC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPC</name>
                            <description>desc STPC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPC</name>
                            <description>desc CMPC</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>desc PERC</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORC</name>
                            <description>desc FORC</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEN</name>
                            <description>desc OUTEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCONR2</name>
                    <description>desc PCONR2</description>
                    <addressOffset>0x144</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13FF</resetMask>
                    <fields>
                        <field>
                            <name>STAC</name>
                            <description>desc STAC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPC</name>
                            <description>desc STPC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPC</name>
                            <description>desc CMPC</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>desc PERC</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORC</name>
                            <description>desc FORC</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEN</name>
                            <description>desc OUTEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCONR3</name>
                    <description>desc PCONR3</description>
                    <addressOffset>0x148</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13FF</resetMask>
                    <fields>
                        <field>
                            <name>STAC</name>
                            <description>desc STAC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPC</name>
                            <description>desc STPC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPC</name>
                            <description>desc CMPC</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>desc PERC</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORC</name>
                            <description>desc FORC</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEN</name>
                            <description>desc OUTEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCONR4</name>
                    <description>desc PCONR4</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13FF</resetMask>
                    <fields>
                        <field>
                            <name>STAC</name>
                            <description>desc STAC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPC</name>
                            <description>desc STPC</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPC</name>
                            <description>desc CMPC</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>desc PERC</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORC</name>
                            <description>desc FORC</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTEN</name>
                            <description>desc OUTEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
