pyocd/pyOCD/pyocd/debug/svd/data/HC32F4A8.svd
                <register>
                    <name>DIEPCTL8</name>
                    <description>desc DIEPCTL8</description>
                    <addressOffset>0xA00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFEF87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>desc USBAEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EONUM_DPID</name>
                            <description>desc EONUM_DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>25</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVNFRM</name>
                            <description>desc SD0PID_SEVNFRM</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SODDFRM</name>
                            <description>desc SODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPINT8</name>
                    <description>desc DIEPINT8</description>
                    <addressOffset>0xA08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x39DB</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISD</name>
                            <description>desc EPDISD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOC</name>
                            <description>desc TOC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTXFE</name>
                            <description>desc TTXFE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNE</name>
                            <description>desc INEPNE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>desc TXFE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXFIFOUDRN</name>
                            <description>desc TXFIFOUDRN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTDRPSTS</name>
                            <description>desc PKTDRPSTS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BERR</name>
                            <description>desc BERR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTSIZ8</name>
                    <description>desc DIEPTSIZ8</description>
                    <addressOffset>0xA10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCNT</name>
                            <description>desc MCNT</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA8</name>
                    <description>desc DIEPDMA8</description>
                    <addressOffset>0xA14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTXFSTS8</name>
                    <description>desc DTXFSTS8</description>
                    <addressOffset>0xA18</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x800</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTFSAV</name>
                            <description>desc INEPTFSAV</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPCTL9</name>
                    <description>desc DIEPCTL9</description>
                    <addressOffset>0xA20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFEF87FF</resetMask>
                    <fields>
                        <field>
                            <name>MPSIZ</name>
                            <description>desc MPSIZ</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>desc USBAEP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EONUM_DPID</name>
                            <description>desc EONUM_DPID</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTS</name>
                            <description>desc NAKSTS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYP</name>
                            <description>desc EPTYP</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>desc STALL</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>desc TXFNUM</description>
                            <msb>25</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>desc CNAK</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>desc SNAK</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVNFRM</name>
                            <description>desc SD0PID_SEVNFRM</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SODDFRM</name>
                            <description>desc SODDFRM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>desc EPDIS</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPENA</name>
                            <description>desc EPENA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPINT9</name>
                    <description>desc DIEPINT9</description>
                    <addressOffset>0xA28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x39DB</resetMask>
                    <fields>
                        <field>
                            <name>XFRC</name>
                            <description>desc XFRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDISD</name>
                            <description>desc EPDISD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOC</name>
                            <description>desc TOC</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TTXFE</name>
                            <description>desc TTXFE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPNE</name>
                            <description>desc INEPNE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>desc TXFE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXFIFOUDRN</name>
                            <description>desc TXFIFOUDRN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTDRPSTS</name>
                            <description>desc PKTDRPSTS</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BERR</name>
                            <description>desc BERR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>desc NAK</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTSIZ9</name>
                    <description>desc DIEPTSIZ9</description>
                    <addressOffset>0xA30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>XFRSIZ</name>
                            <description>desc XFRSIZ</description>
                            <msb>18</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKTCNT</name>
                            <description>desc PKTCNT</description>
                            <msb>28</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCNT</name>
                            <description>desc MCNT</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA9</name>
                    <description>desc DIEPDMA9</description>
                    <addressOffset>0xA34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DTXFSTS9</name>
                    <description>desc DTXFSTS9</description>
                    <addressOffset>0xA38</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x800</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTFSAV</name>
                            <description>desc INEPTFSAV</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
